package com.excitingboat.freshmanspecial.config;

/**
 * Created by PinkD on 2016/8/7.
 * BigData
 */
public class BigData {

    public static final String[] SCHOOL = new String[]{"请选择学院", "通信与信息工程学院 ", "计算机科学与技术学院",
            "光电工程学院", "自动化学院", "理学院", "生物信息学院", "经济管理学院 ", "体育学院", "外国语学院",
            "先进制造工程学院", "传媒艺术学院", "软件工程学院", "法学院", "重庆国际半导体学院"
    };

    public static final String[] SCHOOL_1 = new String[]{"请选择学院", "传媒艺术学院 ", "法学院",
            "光电工程学院/重庆国际半导体学院 ", "国际学院", "计算机科学与技术学院", "经济管理学院 ",
            "理学院", "软件工程学院", "生物信息学院", "体育学院", "通信与信息工程学院 ", "外国语学院",
            "先进制造工程学院", "自动化学院 "
    };

    public static final String[][] MAJOR = new String[][]{{"广播电视编导", "数字媒体艺术与动画类", "艺术设计类"},
            {"法学类"}, {"电子工程类", "集成电路工程类"}, {"电子信息工程", "软件工程"}, {"计算机与智能科学类"},
            {"电子商务类", "工程管理", "工商管理类", "经济学", "信息管理与信息系统"}, {"数理科学与信息技术类"},
            {"软件工程"}, {"生物信息学", "生物医学工程"}, {"社会体育指导与管理"}, {"广电与数字媒体类", "通信信息类"},
            {"英语类"}, {"先进制造类"}, {"自动化与电气工程类"}};

    public static final int[] COLORS = new int[]{
            0xFFCFCCFC, 0xFFB9E6FE, 0xFFFEC7E3, 0xFF0B907C
    };

    public static final double[][][] MAN_WOMAN = new double[][][]{
            {{60, 178}, {63, 106}, {55, 123}}, {{34, 69}}, {{235, 67}, {205, 26}}, {{75, 25}, {85, 15}},
            {{458, 116}}, {{73, 45}, {49, 12}, {86, 118}, {42, 31}, {67, 40}}, {{141, 54}}, {{443, 85}},
            {{48, 24}, {47, 44}}, {{46, 15}}, {{79, 53}, {399, 126}}, {{15, 67}}, {{251, 25}}, {{472, 102}}

    };

    public static final String[][] HARD_SUBJECT = new String[][]{
            {"电子电路", "大学物理", "大学物理", "大学物理", "数学分析", "高等数学", "概率论", "运动解剖学",
                    "基础英语", "工程图学", "视听说", "高等数学", "刑法", "软件设计基础"},
            {"高等数学", "高等数学", "概率论", "高等数学", "高等数学", "视听说", "高等数学",
                    "体育概论", "英语语音", "大学物理", "读写译", "离散数学", "民法", "线性代数"},
            {"大学物理", "线性代数", "工程图学", "C语言", "大学物理", "化学", "C语言", "健美操",
                    "英语阅读", "高等数学", "美术史", "C++", "法理", "大学物理"}
    };
    public static final double[][] HARD_SUBJECT_PERCENT = new double[][]{
            {62.00, 40.00, 54.00, 45.00, 49.00, 45.00, 42.00, 56.00, 44.55, 55.00, 43.00, 56.00, 54.90, 52.00},
            {18.00, 35.00, 26.00, 30.00, 28.00, 31.00, 38.00, 22.00, 28.18, 24.00, 32.00, 23.00, 24.51, 32.00},
            {20.00, 25.00, 20.00, 25.00, 23.00, 24.00, 20.00, 22.00, 27.27, 21.00, 25.00, 21.00, 20.59, 16.00}
    };

    public static final String[] JOB_TYPE = new String[]{
            "签就业协议", "升学出国", "其它"
    };

    public static final double[][] JOB_PERCENT = new double[][]{
            {75.60,22.23,2.17},{ 73.02,21.50,5.48},{ 71.06,23.40,5.54},{ 81.35,17.25,1.40},{ 77.85,14.56,7.59},
            { 71.64,23.51,4.85}, { 85.61,9.30,5.09},{ 86.67,11.67,1.67},{ 84.38,15.63,0.00},{ 85.71,10.08,4.21},
            { 82.64,10.60,6.76},{ 86.97,7.04,5.99},{ 63.75,31.25,5.00},{ 76.03,18.49,5.48}
    };

}

/*



 */