package com.excitingboat.freshmanspecial.config;

/**
 * Created by PinkD on 2016/8/9.
 * Data for style part
 */
public class StyleData {
    public static final String[] ORGANIZATION = new String[]{
            "重庆邮电大学团委各部室\n" +
                    "\n【团委办公室】\n" +
                    "负责协调和承办团委的日常事务；负责团委大型会议的会务工作；团委相关工作的上传与下达；负责网络舆情及调研工作；协助管理团委资产。 \n" +
                    "\n【团委组织部】\n" +
                    "负责团的基层组织建设工作；开展推优入党工作；负责开展青年马克思主义者培养工程； 指导主题团日活动的开展；开展五四评优表彰工作。 \n" +
                    "\n【团委宣传部】\n" +
                    "负责团属刊物的制作；负责团委官方微博、微信等新媒体阵地的建设；负责myouth平台的建设管理；负责校内各项活动的采访、拍摄及相关专题视频的制作。\n \n",
            "重庆邮电大学学生会\n\n" +
                    "重庆邮电大学学生会是由校党委、市学联领导，由校团委具体指导的群众性组织。重庆邮电大学学生会以“全心全意为同学服务”为宗旨，充分发挥同学主人翁精神，加强学风建设，营造浓厚的读书氛围，以提高学生综合素质、推进校园文化建设为目标，创建了一批深受同学们喜爱的科技文化活动，积极营造校园爱心氛围，结合校园实际，积极加强大学生法制观念，维护大学生合法权益，开展文体活动，丰富校园文化生活。利用现有资源，打造网络交流平台，通过编撰刊物，展示理论成果。\n" +
                    "\n【主席团】\n" +
                    "全面主持学生会日常工作，督促和指导各部门工作的开展； 统筹协调校院两级学生会开展工作；定期向学校领导、学生委员会、学生代表大会汇报工作；学生会副主席协助主席开展工作，分管相应工作。 \n" +
                    "\n【综合部】\n" +
                    "负责学生会内部日常管理；协调各学院学生会工作；负责与兄弟高校学生会及校外商家的联络；牵头对各学院学生会的考核。 \n" +
                    "\n【学习部】\n" +
                    "推进学风建设，搭建师生交流桥梁；组织开展辩论赛、读写行等活动； 建设“朋辈辅导”互助平台。 \n" +
                    "\n【宣传部】\n" +
                    "利用新媒体开展学生会宣传工作；设计制作视频、微电影、海报等文化产品；开展校园文化创意活动。\n" +
                    "\n【权益提案部】\n" +
                    "处理提案工作委员会日常事务；负责学生代表提案的征集、立案、报送、督办等工作；搭建青年学生维权服务平台。\n" +
                    "\n【生活服务部】\n" +
                    "处理食品安全与伙食监督管理委员会日常事务；做好与基建后勤、宿舍管理部门的沟通联系；组织开展健康生活、文明生活主题活动。 \n" +
                    "\n【文艺部】\n" +
                    "开展校内文艺活动；搭建同学才艺展示平台；培养同学文艺爱好。\n" +
                    "\n【体育部】\n" +
                    "组织开展“走下网络、走出宿舍、走向操场”群众性体育锻 炼活动。\n" +
                    "\n【女生部】\n" +
                    "反映广大女生的合理利益诉求；组织开展女生节系列活动；配合“文峰女子学堂”开展各类活动。\n \n",
            "重庆邮电大学学生科技联合会\n\n" +
                    "重庆邮电大学科技联合会简称科联、是在校团委指导下，和校学生会齐名组织承办重庆邮电大学所有在校学生科技活动的校级学生组织。以“挑战杯”为龙头，以“学生科技文化节”和“创业计划大赛”为特色品牌，以学生科技沙龙为支柱，并打造了“十佳学生科技标兵”评选等一系列学生课外科技活动，并且长期举办各种有益于学生发展的各种生活IT沙龙以及讲座。重庆邮电大学学生科技联合会，以引领重邮校园的科技时尚，浓厚校园的科技创新氛围为己任，力图打造重庆高校中科技活动组织的第一品牌。\n" +
                    "\n【主席团】\n" +
                    "全面负责科联的各项工作的开展；制定科联年度工作计划和发展规划；指导、检查、督促各部门开展工作，协调各方面关系；定期向团委汇报科联的工作情况。\n" +
                    "\n【综合部】\n" +
                    "负责学生科联日常事务的管理；组织开展学生科联内部活动；协调各学院学生科协的工作；负责与兄弟高校科联组织及校外商家的联络。\n" +
                    "\n【项目管理部】\n" +
                    "组织开展学生科技节系列活动；组织开展大学生创新创业训练营、创新高端论坛等校内 创新创业活动。\n" +
                    "\n【科技人文部】\n" +
                    "组织开展重邮青年说、学长演播厅等活动；组织开展“文峰青年大讲堂”讲座活动；指导学生科协系统的创新文化建设工作。 \n" +
                    "\n【科创竞赛部】\n" +
                    "组织“挑战杯”大学生课外学术科技作品竞赛、“创青春” 全国大学生创业大赛的申报和立项工作；开展无线电测向比赛、科普先锋秀等活动；发布校内外科创赛事资讯。 \n" +
                    "\n【宣传策划部】\n" +
                    "设计与制作海报、门票和展板；拍摄与制作活动视频、微电影；设计制作学生科创文化产品。\n" +
                    "\n【新媒体信息部】\n" +
                    "负责学生科联新媒体的运营工作；负责Html5网页的设计及开发；负责大学生科创网的运营和维护；负责活动现场拍摄及新闻稿的撰写。\n\n",
            "重庆邮电大学学生社团联合会\n\n" +
                    "社团联合会在校团委的直接指导下，管理社团工作、服务社团发展的学生组织，旗下管辖着涵盖文学学术、实践服务、艺术文化、爱好兴趣、体育运动等功能丰富、类型兼备的各类学生社团组织。它以充分调动众多社团及其会员的积极性和创造性，全面开展有深度、有内涵、有品位、有价值、有意义的社团活动，不断丰富校园文化生活，提高当代大学生的学习能力、实践能力、组织能力和创新能力为目标。 作为青年自组织，学生社团是培养和发展大学生兴趣爱好的广阔平台，是培养学生自我教育、自我管理、自我服务的有效形式，是构建“一体两翼”学校团建大格局的重要组成部分，是凝聚青年、丰富校园文化、培育和传承大学精神的重要载体，目前，能否建设好高校的社团已经成为一个高校是否具有活力和文化氛围的重要标志之一。学生社团遍布全国高校校园的各个角落，扮演着丰富校园文化生活、提升校园文化品位、引领校园文化时尚的重要角色。社团联合会扮演着对各社团服务和管理的双重角色，对学生社团的发展起着至关重要的作用。 \n" +
                    "\n【主席团】\n" +
                    "全面主持学生社联各项工作；制定社联工作计划和发展规划；指导、检查、督促各社团开展工作，协调与各学生组织 和社团之间的关系。 \n" +
                    "\n【综合部】\n" +
                    "负责学生社联日常事务的管理；组织开展学生社联内部活动；负责与兄弟高校社联组织及校外商家的联络；联系各学院社团部、各学生社团。 \n" +
                    "\n【宣传部】\n" +
                    "负责学生社联新媒体的运营工作；负责活动海报设计、现场拍摄与后期制作；审核学生社团宣传制品。 \n" +
                    "\n【社团服务部】\n" +
                    "负责社团活动物资的审批、发放工作；组织开展内部培训及素质拓展活动；收集社团活动资料。 \n" +
                    "\n【社团管理部】\n" +
                    "负责新成立社团的审批；负责社团注册、考核、表彰工作；指导社团会长换届工作；监督社团经费使用。 \n" +
                    "\n【社团活动部】\n" +
                    "指导社团开展活动；审核社团活动开展内容；开展社团达人秀、社团推广暨展示周、社团招新等活动。\n\n",
            "重庆邮电大学青年志愿者协会\n\n" +
                    "重庆邮电大学青年志愿者协会成立于2014年6月，其前身是共青团重庆邮电大学委员会社会实践与志愿服务部。主要负责学校社会实践工作和青年志愿者工作的组织与协调，对各团支部的相关活动进行指导和监督；协助团委完成“三下乡”暑期社会实践活动、“12•5国际志愿者日”志愿服务周系列活动、“优秀青年志愿者服务队”评选、“校园文明建设”及共青团城乡市民学校等相关工作。\n" +
                    "\n【主席团】\n" +
                    "统筹协调校院两级青年志愿者组织开展工作；拓展对外交流合作平台。 \n" +
                    "\n【综合管理部】\n" +
                    "负责青协日常事务的管理；负责与兄弟高校青协组织及校外公益组织的联络；联系各学院青协；负责志愿者（义工）服务时长的认定、管理及监督。 \n" +
                    "\n【青年志愿者服务总队】\n" +
                    "组织校内外志愿服务活动；负责优秀志愿服务项目评选。 \n" +
                    "\n【实践服务部】\n" +
                    "负责暑期“三下乡”社会实践活动的组织工作；统筹城乡社区市民学校建设工作。 \n" +
                    "\n【宣传推广部】\n" +
                    "负责青年志愿服务活动宣传；负责青协新媒体平台运营；推广志愿服务品牌项目。\n\n",
            "重庆邮电大学大学生艺术团\n\n" +
                    "重庆邮电大学大学生艺术团是在校团委直接指导管理下的学生艺术团体，肩负组织学校重大文艺活动，代表学校对外联谊，演出和参加省市文艺大赛的重任。秉承“服务同学，锻炼自我”的宗旨，以丰富校园文化生活，陶冶情操，加强与其他院校艺术交流与沟通，为校宣传争光，活跃人文气氛等为前提，要求每个成员在艺术实践中以高标准、严要求的态度约束自己。 大学生艺术团由管乐团、合唱团、舞蹈团、曲艺团组成。主要承担着我校各项大型演出任务，组织编排各项文艺节目，为有文艺特长的同学搭建良好的交流和展示平台，每个分团都有固定的训练时间和专业指导老师。近年来，大学生艺术团一次次圆满完成学校交给的各项文艺演出任务，并锻炼和培养了一批批艺术人才。为我校大学生文艺素质的培养，树立了一面旗帜。\n" +
                    "\n【主席团】\n" +
                    "全面主持艺术团各项工作；负责艺术团工作计划的制定和艺术团建设规划；负责艺术团分团干部的培养、选拔工作；负责策划艺术团各类演出活动。 \n" +
                    "\n【综合部】\n" +
                    "负责艺术团日常事务管理；各类文艺活动的后勤保障工作；负责学生活动中心、管乐团排练厅场地管理；协调和联系其他学生组织及各分团间的工作；负责礼仪志愿者的日常训练及成员的考核工作。 \n" +
                    "\n【管乐团】\n" +
                    "负责管乐团的日常训练及管乐团成员的考核、招新工作；组织参加校内外的演出或比赛； 协助指导教师做好管乐团的节目编排工作。 \n" +
                    "\n【舞蹈团】\n" +
                    "负责舞蹈团的日常训练及舞蹈团成员的考核、招新工作；组织参加校内外的演出或比赛； 协助指导教师做好舞蹈团的节目编排工作。 \n" +
                    "\n【民乐团】\n" +
                    "负责民乐团的日常训练及民乐团成员的考核、招新工作；组织参加校内外的演出或比赛； 协助指导教师做好民乐团的节目编排工作。 \n" +
                    "\n【合唱团】\n" +
                    "负责合唱团的日常训练及合唱团成员的考核、招新工作；组织参加校内外的演出或比赛； 协助指导教师做好合唱团的节目编排工作。 \n" +
                    "\n【话剧团】\n" +
                    "负责话剧团的日常训练及话剧团成员的考核、招新工作；组织参加校内外的演出或比赛；创作并编排新话剧剧本等。\n" +
                    "\n\n"
            ,"红岩网校工作站简介\n\n" +
            "重庆邮电大学红岩网校工作站是一个校园互联网开发团队，自2000年创立以来，已有16个年头了。它是一群志趣相投的在校大学生共同创建的，在校团委老师的指导下，学生自我管理，多年来走出了一大批优秀的IT人才。红岩网校工作站包括五个部门：产品策划&运营部，视觉设计部，Web研发部, 移动开发部和运维安全部。各个部门相互协作，共同推出了重邮小帮手微信公众号、掌上重邮、BT down铺、校园二手拾货网等一系列优秀的校园互联网产品，满足了广大师生的需求，获得一致好评。\n" +
            "\n【产品策划&运营部】\nTa以产品、宣传 、组织、赞助为核心方向，是挖掘用户需求，推广网站文化的运营师；Ta负责产品策划，原型设计，是创意的集结点，是项目的瞭望塔，也是网校各部门沟通的桥梁，是一名产品经理；Ta负责网站线上线下活动的推广，收集并分析用户意见，提出产品功能升级方案，在网校，他们负责网站内容的发布和栏目的更新、网站专题及线上线下活动的策划和制作，利用新媒体平台宣传网校的产品和活动，负责与其他部门组织联系，进行网上的合作共建。我们需要耐心、细心与恒心，以及对产品的热情与责任心，需要学习Office、Ps、Ae、Axure等软件的操作，需要一个产品人的沟通能力和认真态度。\n" +
            "\n" +
            "【视觉设计部】\n\tTa是设计产品图形用户界面，跟踪产品视觉及体验效果的设计师。Ta负责对网站进行整体创意和美术设计，移动端和PC端用户的界面设计；网页宣传海报设计；网站产品的动画及动效设计 ；对设计成果进行定期评估和研究，进行视觉元素的优化设计。部门的发展方向是视觉设计师和UI设计师。\n" +
            "\n" +
            "【Web研发部】\n\tTa分为前端和后台方向。前端主要负责前端开发和页面制作，根据设计图用HTML和CSS完成页面制作；对网站前端性能做相应的优化。而后端是负责数据库设计和服务端逻辑开发；利用LNAMP搭建功能全面、操作方便的后台管理系统。在Web研发部学长学姐们的带领下，能让你感受到 HTML、CSS、JavaScript、PHP的深深的”善意”。在这里大家将会写代码，会上课，那么就会有作业。Web部里的骚年们上可搭建服务器， 下可横扫pc移动h5。\n" +
            "\n" +
            "【移动开发部】\nTa主要负责移动端的开发，以 Java，OC&Swift，C#为主要开发语言，涵盖Android，iOS，Windows 三个平台。在这里你可以学到App的开发制作。在这里学长一堆都是高冷的逗比；移动互联网就是我们的日常；从被大神虐哭到自己成为大神。在移动开发部你将对App感兴趣，对App制作有狂热的欲望。\n" +
            "\n" +
            "【运维安全部】\n  Ta 既是红岩网校运维安全部(内部称之为 网校 SRE ( Site Reliability Engineering ))，也是重庆邮电大学 Linux 协会( CQUPT Linux User Group )。Ta 主要负责维护网校的服务器稳定和安全，同时也负责新项目的部署、环境安全配置和性能优化，还负责了校内的很多公益项目，例如 重庆邮电大学开源镜像站、重庆邮电大学 OpenStack 云计算资源池、重庆邮电大学 MineCraft/CounterStrike 服务器 等等。在这里你可以学习到非常多的酷炫的 Linux 知识和信息安全知识，我们使用 Python 和 Go 语言来开发好玩有趣的项目，在这里你可以利用丰富的服务器资源来搭建自己想做的任何项目。在运维安全部，你要对技术执着、对高性能孜孜不倦，“如果不能优雅的解决这个问题，那我们就有了两个问题”。|´・ω・)ノ\n\n"
    };

    public static final String[] STYLE = new String[]{
            "我抬头仰望，那专属的红绿蓝，牵引着我追寻梦想的思绪。整个校园，就像是一艘正在缓慢行驶的帆船，而这巍峨的第八教学楼仿佛在诉说：“我亲爱的孩子，这里就是你梦想的帆！”",
            "一下子，我跳进了装满情怀的老操场的怀抱，感受着青春留给我的恩泽。不知道在这片红色的跑道上，留下了我多少曾奋力奔跑的脚印。我继续奔跑着，风在我的耳边轻吟：“不停地奔跑，不要放弃！”",
            "恰同学少年的我，常常奔赴于书生意气浓厚的数字图书馆。它就像一本厚厚的百科全书，而里面珍藏的书籍，是它每一章节最强精彩的部分。当我翻开她的卷首，她告诉我：“静观，静思，静记。”",
            "我不知道走过了多少次这样的路，二教，三教，四教……上课，下课，嬉笑，和这几座静谧而安定的教学楼串成了一个个精彩纷呈的，无语伦比的小故事。那一大片的草坪，都在浅唱：“修德、博学、求实、创新。”",
            "我来到信科楼下，驻足，仰望，我想要飞，飞进信科顶端的云层里，憧憬，翱翔，细数我曾在这里做实验敲代码的日日夜夜……云朵在我的身体里飘过，呼唤着：“亲爱的孩子，一步一个脚印，梦想在你的翅膀上！”",
            "在爬完这个远近闻名的重邮天梯，虽然感觉到一阵疲惫但我的心里，却充满了时时刻刻的幸福。我的一个个向上攀爬的身躯都在激励我：“会当凌绝顶，一览众山小。”",
            "夕阳下，你吟出了绝美的一幕。日光与云层交相辉映的太极操场，填满着我整颗感动的心。缓缓坐在足球场上，体味着夕阳融入身体的温暖。身在哪里，心就在哪里，仿佛自己也是这幅画卷里一部分。渐渐的，我听见了整个太极都在呢喃：“青春是一束束淡淡的日光，耀眼并且温暖人心。”",
            "这时，夜幕来临我站在你的面前，凝望着你散发出的神秘色彩，轻抚着你的身躯，感受着你心脏的跳动，全身血液的沸腾，听见了你说，“晚安，我亲爱的孩子！”\n" +
                    "结束了这一段浅浅的重游旅程，我爱上了我所看见的，我所听见的，我所触摸到的……\n" +
                    "我亲爱的校园，你将伴我度过四个春秋，今日和你的浅浅对话，让我心神向往你的美丽……\n" +
                    "\n"

    };
}
